const fewShotExamples = {
    "": 
      "การขอตำแหน่ง รองศาสตราจารย์ (รศ.) ในประเทศไทยนั้น มีขั้นตอนและข้อกำหนดเฉพาะเจาะจงที่ต้องปฏิบัติดังนี้:\n\n" +
      "1. คุณสมบัติเฉพาะตำแหน่ง: ต้องดำรงตำแหน่งผู้ช่วยศาสตราจารย์และปฏิบัติหน้าที่ในตำแหน่งดังกล่าวไม่น้อยกว่า 2 ปี\n\n" +
      "2. ผลการสอน: ต้องมีความชำนาญพิเศษในการสอน และผ่านการประเมินคุณภาพการสอน\n\n" +
      "3. ผลงานทางวิชาการ: ต้องประกอบด้วยผลงานที่มีคุณภาพและปริมาณตามเกณฑ์ที่ ก.พ.อ. กำหนด เช่น งานวิจัยและผลงานที่ได้รับการเผยแพร่ในวารสารวิชาการ\n\n" +
      "4. จริยธรรมและจรรยาบรรณทางวิชาการ: ต้องปฏิบัติตามจริยธรรมและจรรยาบรรณทางวิชาการอย่างเคร่งครัด\n\n" +
      "5. การพิจารณา: ให้คณะกรรมการผู้ทรงคุณวุฒิพิจารณาผลงานและเสนอให้สภาสถาบันอุดมศึกษาพิจารณาอนุมัติ",
    
    "": 
      "การขอตำแหน่ง ผู้ช่วยศาสตราจารย์ (ผศ.) มีขั้นตอนที่ต้องปฏิบัติดังนี้:\n\n" +
      "1. คุณสมบัติเฉพาะตำแหน่ง: ต้องดำรงตำแหน่งอาจารย์และปฏิบัติหน้าที่ในตำแหน่งไม่น้อยกว่า 1 ปี หากสำเร็จการศึกษาระดับปริญญาเอก\n\n" +
      "2. ผลการสอน: ต้องผ่านการประเมินผลการสอนและมีชั่วโมงการสอนที่เทียบค่าได้ไม่น้อยกว่า 3 หน่วยกิตระบบทวิภาค\n\n" +
      "3. ผลงานทางวิชาการ: ต้องประกอบด้วยงานวิจัยและผลงานทางวิชาการที่ผ่านการประเมินตามเกณฑ์ของ ก.พ.อ.\n\n" +
      "4. จริยธรรมและจรรยาบรรณทางวิชาการ: ต้องปฏิบัติตามจริยธรรมและจรรยาบรรณทางวิชาการอย่างเคร่งครัด\n\n" +
      "5. การพิจารณา: ให้คณะกรรมการพิจารณาตำแหน่งทางวิชาการประเมินและเสนอให้สภาสถาบันอุดมศึกษาพิจารณาอนุมัติ",
    
    "": 
      "การขอตำแหน่ง ศาสตราจารย์ (ศจ.) มีขั้นตอนที่ต้องปฏิบัติดังนี้:\n\n" +
      "1. คุณสมบัติเฉพาะตำแหน่ง: ต้องดำรงตำแหน่งรองศาสตราจารย์และปฏิบัติหน้าที่ในตำแหน่งไม่น้อยกว่า 2 ปี\n\n" +
      "2. ผลการสอน: ต้องผ่านการประเมินผลการสอนและมีความชำนาญพิเศษในการสอน\n\n" +
      "3. ผลงานทางวิชาการ: ต้องมีงานวิจัยที่ได้รับการเผยแพร่ในวารสารวิชาการระดับนานาชาติ และต้องมีผลงานที่มีคุณภาพระดับ A ตามที่ ก.พ.อ. กำหนด\n\n" +
      "4. จริยธรรมและจรรยาบรรณทางวิชาการ: ต้องปฏิบัติตามจริยธรรมและจรรยาบรรณทางวิชาการอย่างเคร่งครัด\n\n" +
      "5. การพิจารณา: ให้คณะกรรมการผู้ทรงคุณวุฒิพิจารณาผลงานและเสนอให้สภาสถาบันอุดมศึกษาพิจารณาอนุมัติ และเสนอรัฐมนตรีเพื่อโปรดเกล้าฯ แต่งตั้ง",
       
    "ตอบคำถาม":"ฉันสามารถช่วยตอบคำถามและให้ข้อมูลในเรื่องการเทียบตำแหน่งวิชาการของคณะเทคโนโลยีสารสนเทศมหาวิทยาลัยพะเยา",
    "ใครเป็นคนสร้าง":"\t\t\t\t\t\tจัดทำโดย \n\n นายพิสุทธิ์ เวชกามา รหัส 64023139 \n "
  };
  
  module.exports = fewShotExamples;
  